## Problem Statement 
## Build a prediction model for Salary_hike

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings("ignore")

In [5]:
sal = pd.read_csv('E:\\deeksha\\python\\data\\Salary_Data (1).csv')

In [6]:
##tim = pd.read_csv('E:\\deeksha\\python\\data\\delivery_time.csv')

In [10]:
sal.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [22]:
X= sal.iloc[:,:1]

In [24]:
X

    YearsExperience
0               1.1
1               1.3
2               1.5
3               2.0
4               2.2
5               2.9
6               3.0
7               3.2
8               3.2
9               3.7
10              3.9
11              4.0
12              4.0
13              4.1
14              4.5
15              4.9
16              5.1
17              5.3
18              5.9
19              6.0
20              6.8
21              7.1
22              7.9
23              8.2
24              8.7
25              9.0
26              9.5
27              9.6
28             10.3
29             10.5

In [38]:
y=sal.iloc[:,1:]

In [39]:
y

      Salary
0    39343.0
1    46205.0
2    37731.0
3    43525.0
4    39891.0
5    56642.0
6    60150.0
7    54445.0
8    64445.0
9    57189.0
10   63218.0
11   55794.0
12   56957.0
13   57081.0
14   61111.0
15   67938.0
16   66029.0
17   83088.0
18   81363.0
19   93940.0
20   91738.0
21   98273.0
22  101302.0
23  113812.0
24  109431.0
25  105582.0
26  116969.0
27  112635.0
28  122391.0
29  121872.0

In [40]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size= 0.2,random_state=110)

In [41]:
X_train.head()

    YearsExperience
13              4.1
20              6.8
10              3.9
18              5.9
7               3.2

In [42]:
X_test.head()

    YearsExperience
12              4.0
4               2.2
28             10.3
17              5.3
14              4.5

In [43]:
X_train.shape

(24, 1)

In [44]:
X_test.shape

(6, 1)

In [45]:
y_train.shape

(24, 1)

In [46]:
y_test.shape

(6, 1)

In [54]:
y_train

      Salary
13   57081.0
20   91738.0
10   63218.0
18   81363.0
7    54445.0
19   93940.0
22  101302.0
26  116969.0
11   55794.0
1    46205.0
24  109431.0
5    56642.0
9    57189.0
8    64445.0
2    37731.0
6    60150.0
23  113812.0
16   66029.0
29  121872.0
27  112635.0
25  105582.0
15   67938.0
3    43525.0
0    39343.0

In [55]:
y_test

      Salary
12   56957.0
4    39891.0
28  122391.0
17   83088.0
14   61111.0
21   98273.0

In [47]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(X_train, y_train)

LinearRegression()

In [ ]:
y_pred = mx + c

In [65]:
c = model.intercept_

In [64]:
m = model.coef_

In [62]:
X_test

    YearsExperience
12              4.0
4               2.2
28             10.3
17              5.3
14              4.5
21              7.1

In [67]:
m * 2.2 + c

array([[47585.76772967]])

In [50]:
y_pred_test = model.predict(X_test)
y_pred_test

array([[ 64216.60152855],
       [ 47585.76772967],
       [122424.51982464],
       [ 76227.75927219],
       [ 68836.2775838 ],
       [ 92858.59307107]])

In [58]:
y_pred_test

array([[ 64216.60152855],
       [ 47585.76772967],
       [122424.51982464],
       [ 76227.75927219],
       [ 68836.2775838 ],
       [ 92858.59307107]])

In [51]:
y_pred_train = model.predict(X_train)
y_pred_train

array([[ 65140.5367396 ],
       [ 90086.78743793],
       [ 63292.6663175 ],
       [ 81771.37053849],
       [ 56825.11984016],
       [ 82695.30574953],
       [100250.07475947],
       [115033.03813625],
       [ 64216.60152855],
       [ 39270.35083023],
       [107641.55644786],
       [ 54053.31420701],
       [ 61444.79589541],
       [ 56825.11984016],
       [ 41118.22125233],
       [ 54977.24941806],
       [103021.88039261],
       [ 74379.88885009],
       [124272.39024674],
       [115956.9733473 ],
       [110413.36208101],
       [ 72532.018428  ],
       [ 45737.89730757],
       [ 37422.48040813]])

In [52]:
from sklearn.metrics import r2_score

In [53]:
R2_train = r2_score(y_train, y_pred_train)
R2_test = r2_score(y_test, y_pred_test)
print(R2_train," ",R2_test)

0.9590778164919148   0.9458719613187272